# 1. Wrangling Procedures

# 1.1 Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import os

# 1.2 Importing data

In [2]:
#create path
path = r'C:\Users\Ryan Pares\Instacart Basket Analysis'
#orders data as df_ords
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Original data', 'orders.csv'), index_col = False)
#products data as df_prods
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original data', 'products.csv'), index_col = False)
#departments data as df_dep
df_dep = pd.read_csv(os.path.join(path, '02 Data', 'Original data', 'departments.csv'), index_col = False)

# 1.3 Orders dataframe

In [3]:
#dropping eval_set column from df_ords
df_ords=df_ords.drop(columns = ['eval_set'])

In [4]:
#changing data type for order ID and user ID from df_ords
df_ords['order_id'] = df_ords['order_id'].astype('str')
df_ords['user_id'] = df_ords['user_id'].astype('str')

# 1.4 Departments dataframe

In [5]:
#transposing df_dep
df_dep_t=df_dep.T

# 1.5 Change header of departments df

In [6]:
#take 1st row of df_dep_t for the header
new_header = df_dep_t.iloc[0]

In [7]:
#copying df_dep_t from row 1 onward
df_dep_t_new = df_dep_t[1:]

In [8]:
#set the header row as the df header
df_dep_t_new.columns = new_header

# 1.6 Checking result of the transformation

In [9]:
df_dep_t_new

department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

# 1.7 Creating Data Dictionary

In [10]:
data_dict = df_dep_t_new.to_dict('index')

# Task 4.4

In [13]:
#Answer 2: Order number is a unique identifier for each user's order, it is not logical to perform statistical analyses on it. Therefore, convert it to a string.
df_ords['order_number'] = df_ords['order_number'].astype('str')

In [14]:
#Check to see if the data type changed; Order-number given as Object, hence conversion is successful.
df_ords.dtypes

order_id                   object
user_id                    object
order_number               object
order_dow                   int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

In [16]:
#Answer 3: As in the exercise, column order_dow has been re-named as it was unintuitive.
df_ords.rename(columns = {'order_dow' : 'orders_day_of_the_week'}, inplace = False)

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

In [17]:
#Answer 4: busiest hour of the day.
df_ords['order_hour_of_day'].value_counts(dropna = True)

10    288418
11    284728
15    283639
14    283042
13    277999
12    272841
16    272553
9     257812
17    228795
18    182912
8     178201
19    140569
20    104292
7      91868
21     78109
22     61468
23     40043
6      30529
0      22758
1      12398
5       9569
2       7539
4       5527
3       5474
Name: order_hour_of_day, dtype: int64

The busiest hour of the day is 10am

In [19]:
#Answer 5: "4" in the data dictionary corresponds to the 'Produce' category.
print(data_dict.get('4'))

{'department': 'produce'}

In [20]:
#Answer 6: Creating a subset for breakfast items.
#Identify breakfast dept id:
data_dict

{'1': {'department': 'frozen'},
 '2': {'department': 'other'},
 '3': {'department': 'bakery'},
 '4': {'department': 'produce'},
 '5': {'department': 'alcohol'},
 '6': {'department': 'international'},
 '7': {'department': 'beverages'},
 '8': {'department': 'pets'},
 '9': {'department': 'dry goods pasta'},
 '10': {'department': 'bulk'},
 '11': {'department': 'personal care'},
 '12': {'department': 'meat seafood'},
 '13': {'department': 'pantry'},
 '14': {'department': 'breakfast'},
 '15': {'department': 'canned goods'},
 '16': {'department': 'dairy eggs'},
 '17': {'department': 'household'},
 '18': {'department': 'babies'},
 '19': {'department': 'snacks'},
 '20': {'department': 'deli'},
 '21': {'department': 'missing'}}

department_id for "breakfast" is 14

In [21]:
#Creating the subset
df_prods_breakfast = df_prods.loc[df_prods['department_id'] == 14]

In [22]:
#Check result
df_prods_breakfast.head()

,product_id,product_name,aisle_id,department_id,prices
27,28,Wheat Chex Cereal,121,14,10.1
33,34,NaN,121,14,12.2
67,68,"Pancake Mix, Buttermilk",130,14,13.7
89,90,Smorz Cereal,121,14,3.9
210,211,Gluten Free Organic Cereal Coconut Maple Vanilla,130,14,3.6

In [23]:
#Answer 7: creating "dinner party" subset containing "alcohol", "deli", "bevrages" and "meat/seafood" (5, 20, 7 and 12.)
df_prods_dinner_party = df_prods.loc[df_prods['department_id'].isin([5,20,7,12])]

In [24]:
#Check result
df_prods_dinner_party.head()

,product_id,product_name,aisle_id,department_id,prices
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
6,7,Pure Coconut Water With Orange,98,7,4.4
9,10,Sparkling Orange Juice & Prickly Pear Beverage,115,7,8.4
10,11,Peach Mango Juice,31,7,2.8
16,17,Rendered Duck Fat,35,12,17.1

In [25]:
#Answer 8: number of rows in the dataframe
df_prods_dinner_party.shape

(7650, 5)

The dinner partydata frame has 7650 rows.

In [26]:
#Answer 9: find information about customer with user_id 1
df_user1=df_ords.loc[df_ords['user_id'] == '1']
df_user1

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
5,3367565,1,6,2,7,19.0
6,550135,1,7,1,9,20.0
7,3108588,1,8,1,14,14.0
8,2295261,1,9,1,16,0.0
9,2550362,1,10,4,8,30.0
10,1187899,1,11,4,8,14.0

In [27]:
#Answer 10: stats about the user 1's behaviour
df_user1.describe()

       order_dow  order_hour_of_day  days_since_prior_order
count  11.000000          11.000000               10.000000
mean    2.636364          10.090909               19.000000
std     1.286291           3.477198                9.030811
min     1.000000           7.000000                0.000000
25%     1.500000           7.500000               14.250000
50%     3.000000           8.000000               19.500000
75%     4.000000          13.000000               26.250000
max     4.000000          16.000000               30.000000

Customer 1 places orders on average every 19 days and never spends more than 30 days without placing orders.

In [28]:
#Answer 12; export orders data frame
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_wrangled.csv'))

In [29]:
#Answer 13: export departments data frame
df_dep_t_new.to_csv(os.path.join(path, '02 Data','Prepared Data', 'departments_wrangled.csv'))